Revit 2027 API
BuiltInFailures.MEPCalculationFailures.Network_NoPressureConstraint Property
 The calculation could not be executed as configured. Each network requires at least 1 pressure constraint. Specify the pressure constraint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Network_NoPressureConstraint { get; }
Public Shared ReadOnly Property Network_NoPressureConstraint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Network_NoPressureConstraint {
	FailureDefinitionId^ get ();
}
static member Network_NoPressureConstraint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace